airlines-server/app/controllers/airplanes_controller.rb

  def show
    @airplane = Airplane.find params[:id]
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def edit
    @airplane = Airplane.find params[:id]
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    airplane = Airplane.find params[:id]
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]