airlines-server/app/controllers/application_controller.rb

  def fetch_user
    @current_user = User.find_by :id => session[:user_id] if
    session[:user_id].present?
    session[:user_id] = nil unless @current_user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]